In [1]:
import pandas as pd
import numpy as np
import csv

# 1 : Climate

* Used in tables Country and Climate Metrics

In [2]:
climate = pd.read_csv("climate_change_data.csv", parse_dates = True)
climate.shape

(10000, 9)

In [123]:
# Relevant Years - most recent climate metircs
climate = climate[(climate['Date'] >= '2015') & (climate['Date'] < '2022')]
climate.shape

(3044, 9)

In [3]:
# check for missing data
climate.isnull().sum()

Date              0
Location          0
Country           0
Temperature       0
CO2 Emissions     0
Sea Level Rise    0
Precipitation     0
Humidity          0
Wind Speed        0
dtype: int64

In [4]:
# columns present in dataset
climate.columns

Index(['Date', 'Location', 'Country', 'Temperature', 'CO2 Emissions',
       'Sea Level Rise', 'Precipitation', 'Humidity', 'Wind Speed'],
      dtype='object')

In [5]:
climate = climate.rename(columns = {"Date" : "Year_Recorded", 
                                    "Country" : "Country_Name", 
                                    })


climate.head()

,Year_Recorded,Location,Country_Name,Temperature,CO2 Emissions,Sea Level Rise,Precipitation,Humidity,Wind Speed
0,2000-01-01 00:00:00.000000000,New Williamtown,Latvia,10.688986,403.118903,0.717506,13.835237,23.631256,18.492026
1,2000-01-01 20:09:43.258325832,North Rachel,South Africa,13.814430,396.663499,1.205715,40.974084,43.982946,34.249300
2,2000-01-02 16:19:26.516651665,West Williamland,French Guiana,27.323718,451.553155,-0.160783,42.697931,96.652600,34.124261
3,2000-01-03 12:29:09.774977497,South David,Vietnam,12.309581,422.404983,-0.475931,5.193341,47.467938,8.554563
4,2000-01-04 08:38:53.033303330,New Scottburgh,Moldova,13.210885,410.472999,1.135757,78.695280,61.789672,8.001164

In [6]:
# columns data types
climate.dtypes

Year_Recorded      object
Location           object
Country_Name       object
Temperature       float64
CO2 Emissions     float64
Sea Level Rise    float64
Precipitation     float64
Humidity          float64
Wind Speed        float64
dtype: object

In [7]:
climate.columns

Index(['Year_Recorded', 'Location', 'Country_Name', 'Temperature',
       'CO2 Emissions', 'Sea Level Rise', 'Precipitation', 'Humidity',
       'Wind Speed'],
      dtype='object')

In [8]:
order = ['Country_Name', 'Location', 'Year_Recorded', 'Temperature', 'Humidity', 
         'Wind Speed', 'Precipitation', 'CO2 Emissions', 'Sea Level Rise']

# Reorder columns in the DataFrame
climate = climate[order]
climate.head()

,Country_Name,Location,Year_Recorded,Temperature,Humidity,Wind Speed,Precipitation,CO2 Emissions,Sea Level Rise
0,Latvia,New Williamtown,2000-01-01 00:00:00.000000000,10.688986,23.631256,18.492026,13.835237,403.118903,0.717506
1,South Africa,North Rachel,2000-01-01 20:09:43.258325832,13.814430,43.982946,34.249300,40.974084,396.663499,1.205715
2,French Guiana,West Williamland,2000-01-02 16:19:26.516651665,27.323718,96.652600,34.124261,42.697931,451.553155,-0.160783
3,Vietnam,South David,2000-01-03 12:29:09.774977497,12.309581,47.467938,8.554563,5.193341,422.404983,-0.475931
4,Moldova,New Scottburgh,2000-01-04 08:38:53.033303330,13.210885,61.789672,8.001164,78.695280,410.472999,1.135757

### Data for Country Table

In [9]:
country = climate[["Country_Name", "Location"]]
country.head(3)

    Country_Name          Location
0         Latvia   New Williamtown
1   South Africa      North Rachel
2  French Guiana  West Williamland

In [10]:
# saving country dataset
country.to_csv("Country.csv", index = False)

### Back to climate

In [11]:
climate.head(1)

,Country_Name,Location,Year_Recorded,Temperature,Humidity,Wind Speed,Precipitation,CO2 Emissions,Sea Level Rise
0,Latvia,New Williamtown,2000-01-01 00:00:00.000000000,10.688986,23.631256,18.492026,13.835237,403.118903,0.717506

In [12]:
climate2 = climate.drop(columns = ["Location"])

In [13]:
climate2.head(3)

,Country_Name,Year_Recorded,Temperature,Humidity,Wind Speed,Precipitation,CO2 Emissions,Sea Level Rise
0,Latvia,2000-01-01 00:00:00.000000000,10.688986,23.631256,18.492026,13.835237,403.118903,0.717506
1,South Africa,2000-01-01 20:09:43.258325832,13.814430,43.982946,34.249300,40.974084,396.663499,1.205715
2,French Guiana,2000-01-02 16:19:26.516651665,27.323718,96.652600,34.124261,42.697931,451.553155,-0.160783

In [14]:
climate2.to_csv("ClimateMetricsFinal.csv", index = False)

# 2 : World
* used for Socio_Economic_Damages

In [15]:
world = pd.read_csv("worlddata.csv")
world.head(2)

,country,electricity_access,gdp,gdp_capita,labor_rate,labor_force,land_area,life_expectancy,adult_literacy,water_access,air_pollution,population_density,population,alcohol_consumption,unemployment_rate,social_support,freedom,generosity,income_class,cpi
0,Afghanistan,90.08,1.883323e+10,536.23,47.28,9103245.75,652230.0,62.97,NaN,66.61,100.0,53.94,35179977.00,0.0087,10.341,0.522,0.428,-0.014,Low income,14.25
1,Albania,99.94,1.285605e+10,4473.89,57.54,1362512.25,27400.0,78.93,98.14,93.92,100.0,104.90,2874159.25,5.0375,14.633,0.650,0.752,-0.033,Upper middle income,37.25

In [16]:
world.shape, world.columns

((186, 20),
 Index(['country', 'electricity_access', 'gdp', 'gdp_capita', 'labor_rate',
        'labor_force', 'land_area', 'life_expectancy', 'adult_literacy',
        'water_access', 'air_pollution', 'population_density', 'population',
        'alcohol_consumption', 'unemployment_rate', 'social_support', 'freedom',
        'generosity', 'income_class', 'cpi'],
       dtype='object'))

In [17]:
world = world[["country", "gdp", "gdp_capita", "air_pollution", "population_density", 
               "unemployment_rate", "social_support"]]
world

,country,gdp,gdp_capita,air_pollution,population_density,unemployment_rate,social_support
0,Afghanistan,1.883323e+10,536.23,100.00,53.94,10.341,0.522
1,Albania,1.285605e+10,4473.89,100.00,104.90,14.633,0.650
2,Algeria,1.677553e+11,4117.84,100.00,17.10,10.540,0.785
3,Angola,7.095638e+10,2395.27,100.00,23.82,9.557,NaN
4,Argentina,5.801825e+11,13246.88,95.34,16.01,8.301,0.904
...,...,...,...,...,...,...,...
181,Venezuela,NaN,NaN,99.95,34.48,5.367,0.899
182,Vietnam,2.719536e+11,2903.81,100.00,298.55,1.683,0.852
183,Yemen,3.055268e+10,1038.42,100.00,56.17,13.379,0.756
184,Zambia,2.359868e+10,1382.20,100.00,22.92,7.556,0.730
185,Zimbabwe,2.306319e+10,1573.35,100.00,37.75,6.035,0.758

In [18]:
world.isnull().sum()

country                0
gdp                    3
gdp_capita             3
air_pollution          3
population_density     1
unemployment_rate      4
social_support        33
dtype: int64

In [19]:
world.columns

Index(['country', 'gdp', 'gdp_capita', 'air_pollution', 'population_density',
       'unemployment_rate', 'social_support'],
      dtype='object')

In [20]:
# renaming the columns
world = world.rename(columns = {"country" : "Country Name",
                               "gdp" : "GDP", 
                                "gdp_capita" : "GDP Per Capita", 
                                "population_density" : "Population Density", 
                                "air_pollution" : "Air Pollution", 
                                "unemployment_rate" : "Unemployment Rate", 
                                "social_support" : "Social Support"})
world.head(3)

,Country Name,GDP,GDP Per Capita,Air Pollution,Population Density,Unemployment Rate,Social Support
0,Afghanistan,1.883323e+10,536.23,100.0,53.94,10.341,0.522
1,Albania,1.285605e+10,4473.89,100.0,104.90,14.633,0.650
2,Algeria,1.677553e+11,4117.84,100.0,17.10,10.540,0.785

In [21]:
world.to_csv("socio_econ.csv", index = False)

# 3) Disasters Dataset
* for Natural Disaster, Damages and Economic Damages

In [22]:
NatDisasters = pd.read_csv("EMDAT_1900-2021_NatDis.csv")

In [23]:
NatDisasters = NatDisasters[NatDisasters["Year"] >= 2015]
NatDisasters.shape

(2315, 43)

In [24]:
NatDisasters.head(2)

,Dis No,Year,Seq,Disaster Group,Disaster Subgroup,Disaster Type,Disaster Subtype,Disaster Subsubtype,Event Name,Entry Criteria,...,End Day,Total Deaths,No Injured,No Affected,No Homeless,Total Affected,Reconstruction Costs ('000 US$),Insured Damages ('000 US$),Total Damages ('000 US$),CPI
13099,2015-0118-BGD,2015,118,Natural,Meteorological,Storm,Convective storm,Lightning/Thunderstorms,NaN,Kill,...,7.0,53.0,200.0,20000.0,NaN,20200.0,NaN,NaN,4000.0,92.708822
13100,2015-0054-AFG,2015,54,Natural,Hydrological,Landslide,Avalanche,NaN,NaN,Kill,...,27.0,254.0,NaN,26425.0,6560.0,32985.0,NaN,NaN,3000.0,92.708822

In [25]:
NatDisasters.columns

Index(['Dis No', 'Year', 'Seq', 'Disaster Group', 'Disaster Subgroup',
       'Disaster Type', 'Disaster Subtype', 'Disaster Subsubtype',
       'Event Name', 'Entry Criteria', 'Country', 'ISO', 'Region', 'Continent',
       'Location', 'Origin', 'Associated Dis', 'Associated Dis2',
       'OFDA Response', 'Appeal', 'Declaration', 'Aid Contribution',
       'Dis Mag Value', 'Dis Mag Scale', 'Latitude', 'Longitude', 'Local Time',
       'River Basin', 'Start Year', 'Start Month', 'Start Day', 'End Year',
       'End Month', 'End Day', 'Total Deaths', 'No Injured', 'No Affected',
       'No Homeless', 'Total Affected', 'Reconstruction Costs ('000 US$)',
       'Insured Damages ('000 US$)', 'Total Damages ('000 US$)', 'CPI'],
      dtype='object')

In [26]:
NatDisasters2 = NatDisasters[["Dis No", "Year", 'Disaster Type', "Country", "Region", 
                              "Continent", "Location", 'Total Deaths', 'No Injured', 'No Affected',
                              'No Homeless', 'Total Affected', "Reconstruction Costs ('000 US$)",
                              "Insured Damages ('000 US$)", "Total Damages ('000 US$)"]]

NatDisasters2.head(3)

,Dis No,Year,Disaster Type,Country,Region,Continent,Location,Total Deaths,No Injured,No Affected,No Homeless,Total Affected,Reconstruction Costs ('000 US$),Insured Damages ('000 US$),Total Damages ('000 US$)
13099,2015-0118-BGD,2015,Storm,Bangladesh,Southern Asia,Asia,"Bogra, Rajshahi, Naogaon, Sirajganj, Pabna dis...",53.0,200.0,20000.0,NaN,20200.0,NaN,NaN,4000.0
13100,2015-0054-AFG,2015,Landslide,Afghanistan,Southern Asia,Asia,"Laghman, Nangarhar, Panjsher, Badakhshan, Bamy...",254.0,NaN,26425.0,6560.0,32985.0,NaN,NaN,3000.0
13101,2015-0148-AUS,2015,Storm,Australia,Australia and New Zealand,Oceania,"Dungog, Hunters Hill, Sydney districts (New So...",7.0,NaN,1000.0,NaN,1000.0,NaN,730000.0,1300000.0

In [27]:
NatDisasters2.isnull().sum()

Dis No                                0
Year                                  0
Disaster Type                         0
Country                               0
Region                                0
Continent                             0
Location                            150
Total Deaths                        662
No Injured                         1628
No Affected                         826
No Homeless                        2079
Total Affected                      455
Reconstruction Costs ('000 US$)    2305
Insured Damages ('000 US$)         2118
Total Damages ('000 US$)           1514
dtype: int64

### For Natural Disaster

In [28]:
nat_entity = NatDisasters2[["Year", "Disaster Type", "Country"]]
nat_entity.head(3)

       Year Disaster Type      Country
13099  2015         Storm   Bangladesh
13100  2015     Landslide  Afghanistan
13101  2015         Storm    Australia

In [29]:
nat_entity.to_csv("natural_dis_ent.csv", index = False)

### For Damages (and Economic Damages)

In [30]:
NatDisasters3 = NatDisasters2.rename(columns = {"Reconstruction Costs ('000 US$)" : "Reconstruction Costs", 
                                                "Insured Damages ('000 US$)" : "Insured Damages", 
                                                "Total Damages ('000 US$)" : "Total Damages"})


NatDisasters3 = NatDisasters3.drop(columns = ["Year", "Disaster Type"])
NatDisasters3.head(3)

,Dis No,Country,Region,Continent,Location,Total Deaths,No Injured,No Affected,No Homeless,Total Affected,Reconstruction Costs,Insured Damages,Total Damages
13099,2015-0118-BGD,Bangladesh,Southern Asia,Asia,"Bogra, Rajshahi, Naogaon, Sirajganj, Pabna dis...",53.0,200.0,20000.0,NaN,20200.0,NaN,NaN,4000.0
13100,2015-0054-AFG,Afghanistan,Southern Asia,Asia,"Laghman, Nangarhar, Panjsher, Badakhshan, Bamy...",254.0,NaN,26425.0,6560.0,32985.0,NaN,NaN,3000.0
13101,2015-0148-AUS,Australia,Australia and New Zealand,Oceania,"Dungog, Hunters Hill, Sydney districts (New So...",7.0,NaN,1000.0,NaN,1000.0,NaN,730000.0,1300000.0

In [31]:
NatDisasters3.columns

Index(['Dis No', 'Country', 'Region', 'Continent', 'Location', 'Total Deaths',
       'No Injured', 'No Affected', 'No Homeless', 'Total Affected',
       'Reconstruction Costs', 'Insured Damages', 'Total Damages'],
      dtype='object')

* Damages

In [32]:
damages = NatDisasters3[['Dis No', 'Country', 'Region', 'Continent', 'Location', 'Total Deaths',
       'No Injured', 'No Affected', 'No Homeless', 'Total Affected']]

damages.head(5)

,Dis No,Country,Region,Continent,Location,Total Deaths,No Injured,No Affected,No Homeless,Total Affected
13099,2015-0118-BGD,Bangladesh,Southern Asia,Asia,"Bogra, Rajshahi, Naogaon, Sirajganj, Pabna dis...",53.0,200.0,20000.0,NaN,20200.0
13100,2015-0054-AFG,Afghanistan,Southern Asia,Asia,"Laghman, Nangarhar, Panjsher, Badakhshan, Bamy...",254.0,NaN,26425.0,6560.0,32985.0
13101,2015-0148-AUS,Australia,Australia and New Zealand,Oceania,"Dungog, Hunters Hill, Sydney districts (New So...",7.0,NaN,1000.0,NaN,1000.0
13102,2015-0479-BHS,Bahamas (the),Caribbean,Americas,"Exuma, Long Island, Mayaguana, Rum Cay, San Sa...",33.0,NaN,6710.0,NaN,6710.0
13103,2015-0090-AGO,Angola,Middle Africa,Africa,Luanda province,1.0,NaN,2000.0,NaN,2000.0

In [33]:
damages.to_csv("damages.csv",  index = False)

* For Economic Damages

In [34]:
econ_damages = NatDisasters3
econ_damages.head(3)

,Dis No,Country,Region,Continent,Location,Total Deaths,No Injured,No Affected,No Homeless,Total Affected,Reconstruction Costs,Insured Damages,Total Damages
13099,2015-0118-BGD,Bangladesh,Southern Asia,Asia,"Bogra, Rajshahi, Naogaon, Sirajganj, Pabna dis...",53.0,200.0,20000.0,NaN,20200.0,NaN,NaN,4000.0
13100,2015-0054-AFG,Afghanistan,Southern Asia,Asia,"Laghman, Nangarhar, Panjsher, Badakhshan, Bamy...",254.0,NaN,26425.0,6560.0,32985.0,NaN,NaN,3000.0
13101,2015-0148-AUS,Australia,Australia and New Zealand,Oceania,"Dungog, Hunters Hill, Sydney districts (New So...",7.0,NaN,1000.0,NaN,1000.0,NaN,730000.0,1300000.0

In [155]:
econ_damages.to_csv("econ_dam.csv", index = False)

In [171]:
occurs_relation = NatDisasters2[['Year', 'Disaster Type', 'Country', 'Region']]


order = ["Country", "Region", "Year", 'Disaster Type']

occurs_relation = occurs_relation[order]
occurs_relation.to_csv("occurs_relation.csv", index = False)

# SQL - CREATE TABLE STATEMENTS + INSERT STATEMENTS GENERATING

In [176]:
sql_statement = """
CREATE TABLE Climate_Metrics(
    Country_Name CHAR(20),
    Year_Recorded INT, 
    Temperature FLOAT,
    Humidity FLOAT, 
    Wind_Speed FLOAT, 
    Precipitation FLOAT, 
    CO2_Emissions FLOAT, 
    Sea_Level_Rise FLOAT,
    PRIMARY KEY (Country_Name, Year_Recorded)
);

CREATE TABLE Country (
    Name CHAR(20),
    Geographic_Location CHAR (20),
    PRIMARY KEY (Name, Geographic_Location)
);

CREATE TABLE Natural_Disaster(
    Disaster_Year INT, 
    Type CHAR(20), 
    Country_Name CHAR(20), 
    Year_Recorded INT,
    PRIMARY KEY (Disaster_Year, Type)
    FOREIGN KEY (Country_Name, Year_Recorded) REFERENCES Climate_Metrics(Country Name, Year_Recorded)
        ON DELETE CASCADE
        ON UPDATE CASCADE
);

CREATE TABLE Disaster_In_Country(
    Name CHAR(20), 
    Geographic_Location CHAR(20), 
    Disaster_Year INT, 
    Type CHAR(20), 
    PRIMARY KEY (Name, Geographic_Location, Disaster_Year, Type)
    FOREIGN KEY (Name, Geographic_Location) REFERENCES Country(Name, Geographic_Location)
        ON DELETE CASCADE
        ON UPDATE CASCADE
    FOREIGN KEY (Disaster_Year, Type) REFERENCES Natural_Disaster(Disaster_Year, Type)
        ON DELETE CASCADE
        ON UPDATE CASCADE
);

CREATE TABLE Damages(
    Country_Name CHAR(20),
    Disaster_Type  CHAR(20),
    Injury_Rate FLOAT,
    Death_Rate FLOAT, 
    Homelessness_Rate FLOAT,
    PRIMARY KEY (Country_Name, Disaster_Type) 
    FOREIGN KEY (Disaster_Year, Type) REFERENCES Natural_Disaster(Country_Name, Type)
    ON DELETE CASCADE
    ON UPDATE CASCADE
    (Disaster_Year, Type)
);

CREATE TABLE Economic_Damages(
    Total_Economic_Damages FLOAT,
    Country_Name CHAR(20),
    Disaster_Type CHAR(20),
    Year INT, 
    Total Economic Damages as GDP share FLOAT, 
    Insured Damages FLOAT, 
    Reconstruction Costs FLOAT,
    PRIMARY KEY (Total Economic Damages, Country Name, Disaster Type, Year)
    FOREIGN KEY (Country Name, Disaster Type, Year) REFERENCES Damages(Country_Name, Disaster_Type, Year)
        ON DELETE CASCADE
        ON UPDATE CASCADE
);

CREATE TABLE Socio_Economic_Damages(
    GDP FLOAT,
    GDP_Per_Capita FLOAT,
    Population_Density FLOAT,
    Social_Support FLOAT,
    Unemployment_Rate FLOAT,
    Name CHAR(20) NOT NULL,
    GeographicLocation CHAR(20) NOT NULL,
    Country_Name CHAR(20),
    Disaster_Type CHAR(20), 
    Year INT,
    PRIMARY KEY (Country_Name, Disaster_Type, Year), 
    FOREIGN KEY (Name, Geographic_Location) REFERENCES Country(Name, Geographic_Location)
        ON DELETE CASCADE
        ON UPDATE CASCADE
    UNIQUE (Country_Name, Disaster_Type, Year)
    FOREIGN KEY (Country_Name, Disaster_Type, Year) REFERENCES Damages(Country_Name, Disaster_Type, Year)
        ON DELETE NO ACTION
        ON UPDATE CASCASE
);


"""

In [177]:
# Open a new file in write mode to create the SQL file
with open("sql_statements.sql", "w") as file:
    # Write the SQL statement to the file
    file.write(sql_statement)

In [178]:
# Function takes csv datafile and table name to generate INSERT statements
def generate_insert_statements(file_name, table_name):
    insert_statements = []
    with open(file_name, 'r', newline='') as csvfile:
        reader = csv.reader(csvfile)
        next(reader)
        for row in reader:
            values = ', '.join([f'{value}' if not value.isdigit() else value for value in row])
            insert_statement = f"INSERT INTO {table_name} VALUES ({values});"
            insert_statements.append(insert_statement)
    return insert_statements



def add_insert_statements(insert_statements, file_name='sql_statements.sql'):
    with open(file_name, 'a') as file:
        for statement in insert_statements:
            file.write(statement + '\n')

In [179]:
# Usage

climate_file = "ClimateMetricsFinal.csv"  
country_file = "Country.csv"
natural_file = "natural_dis_ent.csv"
occurs = "occurs_relation.csv"
damages_file = "damages.csv"
econ_damages_file = "econ_dam.csv"
socio_econ_file = "socio_econ.csv"

insert_climate = generate_insert_statements(climate_file, "Climate_Metrics")
insert_country = generate_insert_statements(country_file, "Country")
insert_natural = generate_insert_statements(natural_file, "Natural_Disaster")
insert_occurs = generate_insert_statements(occurs, "Disaster_In_Country")
insert_damages = generate_insert_statements(damages_file, "Damages")
insert_econdamages = generate_insert_statements(econ_damages_file, "Economic_Damages")
insert_socioecon = generate_insert_statements(socio_econ_file, "Socio_Economic_Damages")

add_insert_statements(insert_climate)
add_insert_statements(insert_country)
add_insert_statements(insert_natural)
add_insert_statements(insert_occurs)
add_insert_statements(insert_damages)
add_insert_statements(insert_econdamages)
add_insert_statements(insert_socioecon)

### CITATIONS:

SQLServerCentral. (2023, May 5). Python 3 Script for Generating SQL INSERT Statements from CSV Data. SQLServerCentral. Retrieved March 8, 2024, from https://www.sqlservercentral.com/scripts/python-3-script-for-generating-sql-insert-statements-from-csv-data

FoxInfotech. (2023, March 30). How to Convert CSV to SQL INSERT Statements. DEV Community. Retrieved March 8, 2024, from https://dev.to/foxinfotech/how-to-convert-csv-to-sql-insert-statements-2on